"use strict";

module.exports.mockCategories = [
  `Программирование`,
  `Без рамки`,
  `Железо`,
  `За жизнь`,
  `Деревья`,
  `IT`,
  `Музыка`,
  `Кино`,
  `Разное`,
];

module.exports.mockArticles = [
  {
    title: `Обзор новейшего смартфона`,
    announce: `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Программировать не настолько сложно, как об этом говорят. Он написал больше 30 хитов.`,
    image: `skyscraper@1x.jpg`,
    fullText: `Первая большая ёлка была установлена только в 1938 году. Золотое сечение — соотношение двух величин, гармоническая пропорция. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Ёлки — это не просто красивое дерево. Это прочная древесина. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Собрать камни бесконечности легко, если вы прирожденный герой. Как начать действовать? Для начала просто соберитесь. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Он написал больше 30 хитов. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Это один из лучших рок-музыкантов. Программировать не настолько сложно, как об этом говорят. Простые ежедневные упражнения помогут достичь успеха. Достичь успеха помогут ежедневные повторения. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
    categories: [
      `Железо`,
      `Без рамки`,
      `Разное`,
      `Программирование`,
      `За жизнь`,
      `IT`,
    ],
    comments: [
      {
        text: `С чем связана продажа? Почему так дешёво? А где блок питания?`,
      },
      {
        text: `Неплохо, но дорого.`,
      },
      {
        text: `Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво?`,
      },
    ],
  },
  {
    title: `Как собрать камни бесконечности`,
    announce: `Золотое сечение — соотношение двух величин, гармоническая пропорция. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
    image: `forest@1x.jpg`,
    fullText: `Первая большая ёлка была установлена только в 1938 году. Как начать действовать? Для начала просто соберитесь. Из под его пера вышло 8 платиновых альбомов.`,
    categories: [
      `Музыка`,
      `IT`,
      `За жизнь`,
      `Разное`,
      `Без рамки`,
      `Деревья`,
      `Железо`,
      `Программирование`,
    ],
    comments: [
      {
        text: `Почему в таком ужасном состоянии?`,
      },
    ],
  },
  {
    title: `Как собрать камни бесконечности`,
    announce: `Как начать действовать? Для начала просто соберитесь. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Простые ежедневные упражнения помогут достичь успеха.`,
    image: `skyscraper@1x.jpg`,
    fullText: `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Достичь успеха помогут ежедневные повторения. Программировать не настолько сложно, как об этом говорят. Первая большая ёлка была установлена только в 1938 году. Собрать камни бесконечности легко, если вы прирожденный герой.`,
    categories: [`Железо`, `Программирование`, `IT`, `Деревья`],
    comments: [
      {
        text: `Совсем немного... Оплата наличными или перевод на карту?`,
      },
      {
        text: `С чем связана продажа? Почему так дешёво?`,
      },
    ],
  },
  {
    title: `Самый лучший музыкальный альбом этого года`,
    announce: ``,
    fullText: `Золотое сечение — соотношение двух величин, гармоническая пропорция. Первая большая ёлка была установлена только в 1938 году. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Ёлки — это не просто красивое дерево. Это прочная древесина. Как начать действовать? Для начала просто соберитесь. Из под его пера вышло 8 платиновых альбомов. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Простые ежедневные упражнения помогут достичь успеха. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Это один из лучших рок-музыкантов. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    image: `sea@1x.jpg`,
    categories: [`Кино`, `Деревья`, `За жизнь`, `IT`],
    comments: [
      {
        text: `Продаю в связи с переездом. Отрываю от сердца. А сколько игр в комплекте? С чем связана продажа? Почему так дешёво?`,
      },
      {
        text: `С чем связана продажа? Почему так дешёво? Совсем немного...`,
      },
      {
        text: `А где блок питания? Оплата наличными или перевод на карту? Вы что?! В магазине дешевле.`,
      },
    ],
  },
  {
    title: `Как перестать беспокоиться и начать жить`,
    announce: `Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
    fullText: `Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    image: `forest@1x.jpg`,
    categories: [`Железо`],
    comments: [
      {
        text: `Неплохо, но дорого. А сколько игр в комплекте?`,
      },
      {
        text: `Оплата наличными или перевод на карту? Неплохо, но дорого.`,
      },
      {
        text: `Неплохо, но дорого. Продаю в связи с переездом. Отрываю от сердца.`,
      },
      {
        text: `Вы что?! В магазине дешевле. Совсем немного...`,
      },
    ],
  },
];
