"use strict";

module.exports.mockCategories = [
  `Программирование`,
  `Без рамки`,
  `Железо`,
  `За жизнь`,
  `Деревья`,
  `IT`,
  `Музыка`,
  `Кино`,
  `Разное`,
];

module.exports.mockArticles = [
  {
    title: `Обзор новейшего смартфона`,
    announce: `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Достичь успеха помогут ежедневные повторения. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
    image: `skyscraper@1x.jpg`,
    fullText: `Он написал больше 30 хитов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Простые ежедневные упражнения помогут достичь успеха. Из под его пера вышло 8 платиновых альбомов. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Достичь успеха помогут ежедневные повторения. Золотое сечение — соотношение двух величин, гармоническая пропорция. Первая большая ёлка была установлена только в 1938 году. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    categories: [`Программирование`, `Без рамки`, `Железо`],
    comments: [
      {
        text: `Продаю в связи с переездом. Отрываю от сердца.`,
      },
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Как перестать беспокоиться и начать жить`,
    announce: `Ёлки — это не просто красивое дерево. Это прочная древесина. Он написал больше 30 хитов. Как начать действовать? Для начала просто соберитесь. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике.`,
    image: `forest@1x.jpg`,
    fullText: `Как начать действовать? Для начала просто соберитесь.`,
    categories: [
      `Железо`,
      `За жизнь`,
      `Деревья`,
      `IT`,
      `Без рамки`,
      `Музыка`,
      `Программирование`,
    ],
    comments: [
      {
        text: `Почему в таком ужасном состоянии? А где блок питания? Неплохо, но дорого.`,
      },
      {
        text: `Вы что?! В магазине дешевле.`,
      },
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Лучшие рок-музыканты 20-века`,
    announce: `Это один из лучших рок-музыкантов. Из под его пера вышло 8 платиновых альбомов.`,
    image: `skyscraper@1x.jpg`,
    fullText: `Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Собрать камни бесконечности легко, если вы прирожденный герой.`,
    categories: [`IT`, `Без рамки`, `Железо`, `За жизнь`, `Кино`],
    comments: [
      {
        text: `Почему в таком ужасном состоянии? А сколько игр в комплекте?`,
      },
      {
        text: `Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту?`,
      },
      {
        text: `А сколько игр в комплекте? Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво? А где блок питания?`,
      },
      {
        text: `Неплохо, но дорого. Почему в таком ужасном состоянии? Вы что?! В магазине дешевле.`,
      },
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Учим HTML и CSS`,
    announce: `Просто действуйте. Маленькими шагами.`,
    fullText: `Золотое сечение — соотношение двух величин, гармоническая пропорция. Как начать действовать? Для начала просто соберитесь. Это один из лучших рок-музыкантов.`,
    image: `sea@1x.jpg`,
    categories: [`Деревья`, `Железо`, `За жизнь`, `IT`],
    comments: [
      {
        text: `А сколько игр в комплекте?`,
      },
      {
        text: `Продаю в связи с переездом. Отрываю от сердца. Неплохо, но дорого.`,
      },
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Как начать программировать`,
    announce: `Первая большая ёлка была установлена только в 1938 году. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много.`,
    image: `forest@1x.jpg`,
    fullText: `Из под его пера вышло 8 платиновых альбомов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Первая большая ёлка была установлена только в 1938 году. Как начать действовать? Для начала просто соберитесь. Ёлки — это не просто красивое дерево. Это прочная древесина. Простые ежедневные упражнения помогут достичь успеха. Золотое сечение — соотношение двух величин, гармоническая пропорция. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    categories: [`Без рамки`, `Разное`, `Железо`, `Программирование`, `Музыка`],
    comments: [
      {
        text: `А где блок питания?`,
      },
      {
        text: `А сколько игр в комплекте? А где блок питания?`,
      },
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
];
