"use strict";

module.exports.mockCategories = [
  `Программирование`,
  `Без рамки`,
  `Железо`,
  `За жизнь`,
  `Деревья`,
  `IT`,
  `Музыка`,
  `Кино`,
  `Разное`,
];

module.exports.mockArticles = [
  {
    title: `Что такое золотое сечение`,
    announce: `Программировать не настолько сложно, как об этом говорят. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    image: `forest@1x.jpg`,
    fullText: `Как начать действовать? Для начала просто соберитесь. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Золотое сечение — соотношение двух величин, гармоническая пропорция. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Программировать не настолько сложно, как об этом говорят. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Простые ежедневные упражнения помогут достичь успеха. Он написал больше 30 хитов.`,
    categories: [
      `Без рамки`,
      `Деревья`,
      `Программирование`,
      `За жизнь`,
      `Кино`,
    ],
    comments: [
      {
        text: `С чем связана продажа? Почему так дешёво?`,
      },
      {
        text: `А где блок питания?`,
      },
    ],
  },
  {
    title: `Как начать программировать`,
    announce: `Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    image: `sea@1x.jpg`,
    fullText: `Первая большая ёлка была установлена только в 1938 году. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Золотое сечение — соотношение двух величин, гармоническая пропорция. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Это один из лучших рок-музыкантов. Как начать действовать? Для начала просто соберитесь. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Простые ежедневные упражнения помогут достичь успеха. Из под его пера вышло 8 платиновых альбомов. Он написал больше 30 хитов. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    categories: [`Музыка`, `Без рамки`, `Железо`, `Разное`],
    comments: [
      {
        text: `Совсем немного...`,
      },
    ],
  },
  {
    title: `Рок — это протест`,
    announce: `Ёлки — это не просто красивое дерево. Это прочная древесина. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    image: `skyscraper@1x.jpg`,
    fullText: `Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Собрать камни бесконечности легко, если вы прирожденный герой. Ёлки — это не просто красивое дерево. Это прочная древесина. Первая большая ёлка была установлена только в 1938 году. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Достичь успеха помогут ежедневные повторения. Программировать не настолько сложно, как об этом говорят. Простые ежедневные упражнения помогут достичь успеха. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Это один из лучших рок-музыкантов. Золотое сечение — соотношение двух величин, гармоническая пропорция. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Он написал больше 30 хитов.`,
    categories: [`Разное`, `IT`],
    comments: [
      {
        text: `С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца.`,
      },
      {
        text: `А где блок питания?`,
      },
      {
        text: `Совсем немного... Оплата наличными или перевод на карту?`,
      },
      {
        text: `А где блок питания? С чем связана продажа? Почему так дешёво? Совсем немного... Оплата наличными или перевод на карту?`,
      },
    ],
  },
  {
    title: `Самый лучший музыкальный альбом этого года`,
    announce: `Это один из лучших рок-музыкантов.`,
    image: `forest@1x.jpg`,
    fullText: `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Первая большая ёлка была установлена только в 1938 году. Простые ежедневные упражнения помогут достичь успеха.`,
    categories: [
      `За жизнь`,
      `Музыка`,
      `Деревья`,
      `Железо`,
      `Без рамки`,
      `IT`,
      `Разное`,
    ],
    comments: [
      {
        text: `Почему в таком ужасном состоянии?`,
      },
      {
        text: `Вы что?! В магазине дешевле.`,
      },
      {
        text: `Почему в таком ужасном состоянии?`,
      },
      {
        text: `Оплата наличными или перевод на карту? Почему в таком ужасном состоянии? Совсем немного...`,
      },
      {
        text: `Почему в таком ужасном состоянии? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту?`,
      },
    ],
  },
  {
    title: `Учим HTML и CSS`,
    announce: `Из под его пера вышло 8 платиновых альбомов. Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    image: `sea@1x.jpg`,
    fullText: `Это один из лучших рок-музыкантов. Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Как начать действовать? Для начала просто соберитесь. Золотое сечение — соотношение двух величин, гармоническая пропорция. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Ёлки — это не просто красивое дерево. Это прочная древесина. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Он написал больше 30 хитов. Из под его пера вышло 8 платиновых альбомов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    categories: [`IT`, `Кино`],
    comments: [
      {
        text: `Продаю в связи с переездом. Отрываю от сердца.`,
      },
    ],
  },
];

module.exports.mockArticleId = `1`;

module.exports.mockCommentId = `1`;

module.exports.mockValidComment = {
  text: `Как достигнуть успеха не вставая с кресла?`,
};

module.exports.mockInvalidComment = {
  title: `Как достигнуть успеха не вставая с кресла?`,
};
