"use strict";

module.exports.mockCategories = [
  `Программирование`,
  `Без рамки`,
  `Железо`,
  `За жизнь`,
  `Деревья`,
  `IT`,
  `Музыка`,
  `Кино`,
  `Разное`,
];

module.exports.mockArticles = [
  {
    title: `Что такое золотое сечение`,
    announce: `Программировать не настолько сложно, как об этом говорят. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    image: `forest@1x.jpg`,
    fullText: `Как начать действовать? Для начала просто соберитесь. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Золотое сечение — соотношение двух величин, гармоническая пропорция. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Программировать не настолько сложно, как об этом говорят. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Простые ежедневные упражнения помогут достичь успеха. Он написал больше 30 хитов.`,
    categories: [
      `Без рамки`,
      `Деревья`,
      `Программирование`,
      `За жизнь`,
      `Кино`,
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Как начать программировать`,
    announce: `Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    image: `sea@1x.jpg`,
    fullText: `Первая большая ёлка была установлена только в 1938 году. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Золотое сечение — соотношение двух величин, гармоническая пропорция. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Это один из лучших рок-музыкантов. Как начать действовать? Для начала просто соберитесь. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Простые ежедневные упражнения помогут достичь успеха. Из под его пера вышло 8 платиновых альбомов. Он написал больше 30 хитов. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    categories: [`Музыка`, `Без рамки`, `Железо`, `Разное`],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Рок — это протест`,
    announce: `Ёлки — это не просто красивое дерево. Это прочная древесина. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    image: `skyscraper@1x.jpg`,
    fullText: `Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Собрать камни бесконечности легко, если вы прирожденный герой. Ёлки — это не просто красивое дерево. Это прочная древесина. Первая большая ёлка была установлена только в 1938 году. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Достичь успеха помогут ежедневные повторения. Программировать не настолько сложно, как об этом говорят. Простые ежедневные упражнения помогут достичь успеха. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Это один из лучших рок-музыкантов. Золотое сечение — соотношение двух величин, гармоническая пропорция. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Он написал больше 30 хитов.`,
    categories: [`Разное`, `IT`],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Самый лучший музыкальный альбом этого года`,
    announce: `Это один из лучших рок-музыкантов.`,
    image: `forest@1x.jpg`,
    fullText: `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Первая большая ёлка была установлена только в 1938 году. Простые ежедневные упражнения помогут достичь успеха.`,
    categories: [
      `За жизнь`,
      `Музыка`,
      `Деревья`,
      `Железо`,
      `Без рамки`,
      `IT`,
      `Разное`,
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Учим HTML и CSS`,
    announce: `Из под его пера вышло 8 платиновых альбомов. Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    image: `sea@1x.jpg`,
    fullText: `Это один из лучших рок-музыкантов. Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Как начать действовать? Для начала просто соберитесь. Золотое сечение — соотношение двух величин, гармоническая пропорция. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Ёлки — это не просто красивое дерево. Это прочная древесина. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Он написал больше 30 хитов. Из под его пера вышло 8 платиновых альбомов. Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    categories: [`IT`, `Кино`],
    date: `2022-05-28T11:00:56.089Z`,
  },
];

module.exports.mockComments = [
  {
    text: `Неплохо, но дорого. С чем связана продажа? Почему так дешёво? Почему в таком ужасном состоянии? Оплата наличными или перевод на карту? Вы что?! В магазине дешевле.`,
    articleId: 1,
    userId: 2,
  },
  {
    text: `А сколько игр в комплекте? Продаю в связи с переездом. Отрываю от сердца. Неплохо, но дорого.`,
    articleId: 1,
    userId: 3,
  },
  {
    text: `Вы что?! В магазине дешевле. Совсем немного... С чем связана продажа? Почему так дешёво? А где блок питания? Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 1,
    userId: 4,
  },
  {
    text: `Оплата наличными или перевод на карту? Неплохо, но дорого. Совсем немного...`,
    articleId: 1,
    userId: 5,
  },
  {
    text: `Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. А где блок питания?`,
    articleId: 1,
    userId: 2,
  },
  {
    text: `А где блок питания? Неплохо, но дорого. С чем связана продажа? Почему так дешёво?`,
    articleId: 2,
    userId: 2,
  },
  {
    text: `Оплата наличными или перевод на карту? Вы что?! В магазине дешевле. Неплохо, но дорого.`,
    articleId: 2,
    userId: 5,
  },
  {
    text: `Почему в таком ужасном состоянии? Оплата наличными или перевод на карту? Вы что?! В магазине дешевле. А где блок питания? С чем связана продажа? Почему так дешёво?`,
    articleId: 2,
    userId: 5,
  },
  {
    text: `А сколько игр в комплекте? Неплохо, но дорого. А где блок питания? Почему в таком ужасном состоянии? Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 3,
    userId: 3,
  },
  {
    text: `Почему в таком ужасном состоянии? Совсем немного... Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 3,
    userId: 1,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии? Неплохо, но дорого. Совсем немного...`,
    articleId: 3,
    userId: 1,
  },
  {
    text: `Совсем немного... А где блок питания? Вы что?! В магазине дешевле.`,
    articleId: 3,
    userId: 3,
  },
  {
    text: `Неплохо, но дорого. Почему в таком ужасном состоянии? Оплата наличными или перевод на карту? Вы что?! В магазине дешевле. А где блок питания?`,
    articleId: 3,
    userId: 4,
  },
  {
    text: `Совсем немного... Продаю в связи с переездом. Отрываю от сердца. А где блок питания? А сколько игр в комплекте?`,
    articleId: 4,
    userId: 1,
  },
  {
    text: `Вы что?! В магазине дешевле. А сколько игр в комплекте? Почему в таком ужасном состоянии? Совсем немного...`,
    articleId: 4,
    userId: 3,
  },
  {
    text: `А сколько игр в комплекте? С чем связана продажа? Почему так дешёво? Неплохо, но дорого. Вы что?! В магазине дешевле. Совсем немного...`,
    articleId: 4,
    userId: 3,
  },
  {
    text: `Оплата наличными или перевод на карту? Совсем немного... Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво?`,
    articleId: 5,
    userId: 5,
  },
  {
    text: `А где блок питания? Вы что?! В магазине дешевле. Оплата наличными или перевод на карту? Совсем немного... Неплохо, но дорого.`,
    articleId: 5,
    userId: 4,
  },
  {
    text: `Совсем немного... С чем связана продажа? Почему так дешёво? Почему в таком ужасном состоянии?`,
    articleId: 5,
    userId: 2,
  },
  {
    text: `А где блок питания? Неплохо, но дорого. А сколько игр в комплекте?`,
    articleId: 5,
    userId: 1,
  },
  {
    text: `С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии? Оплата наличными или перевод на карту?`,
    articleId: 5,
    userId: 5,
  },
  {
    text: `Вы что?! В магазине дешевле. Совсем немного... А сколько игр в комплекте? С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 6,
    userId: 1,
  },
  {
    text: `Оплата наличными или перевод на карту? Почему в таком ужасном состоянии? Вы что?! В магазине дешевле. Совсем немного...`,
    articleId: 6,
    userId: 4,
  },
  {
    text: `С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца. Неплохо, но дорого. А сколько игр в комплекте? Вы что?! В магазине дешевле.`,
    articleId: 6,
    userId: 1,
  },
  {
    text: `А где блок питания? Неплохо, но дорого. Оплата наличными или перевод на карту? Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии?`,
    articleId: 6,
    userId: 5,
  },
  {
    text: `Почему в таком ужасном состоянии? Совсем немного... Неплохо, но дорого. Вы что?! В магазине дешевле.`,
    articleId: 7,
    userId: 3,
  },
  {
    text: `Оплата наличными или перевод на карту? Почему в таком ужасном состоянии? А где блок питания? А сколько игр в комплекте? Совсем немного...`,
    articleId: 7,
    userId: 3,
  },
  {
    text: `Вы что?! В магазине дешевле. Неплохо, но дорого. Оплата наличными или перевод на карту? Почему в таком ужасном состоянии?`,
    articleId: 7,
    userId: 4,
  },
  {
    text: `Совсем немного... Оплата наличными или перевод на карту? С чем связана продажа? Почему так дешёво? А где блок питания?`,
    articleId: 7,
    userId: 2,
  },
  {
    text: `А сколько игр в комплекте? Почему в таком ужасном состоянии? Неплохо, но дорого. Оплата наличными или перевод на карту? Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 8,
    userId: 2,
  },
  {
    text: `С чем связана продажа? Почему так дешёво? Совсем немного... Почему в таком ужасном состоянии?`,
    articleId: 8,
    userId: 5,
  },
  {
    text: `Неплохо, но дорого. Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво? Почему в таком ужасном состоянии? А сколько игр в комплекте?`,
    articleId: 8,
    userId: 2,
  },
  {
    text: `А где блок питания? Продаю в связи с переездом. Отрываю от сердца. Неплохо, но дорого.`,
    articleId: 8,
    userId: 2,
  },
  {
    text: `А сколько игр в комплекте? Неплохо, но дорого. Почему в таком ужасном состоянии?`,
    articleId: 9,
    userId: 1,
  },
  {
    text: `С чем связана продажа? Почему так дешёво? А где блок питания? Неплохо, но дорого.`,
    articleId: 9,
    userId: 1,
  },
  {
    text: `Совсем немного... Продаю в связи с переездом. Отрываю от сердца. А сколько игр в комплекте?`,
    articleId: 9,
    userId: 3,
  },
  {
    text: `Оплата наличными или перевод на карту? Неплохо, но дорого. С чем связана продажа? Почему так дешёво? Совсем немного... Почему в таком ужасном состоянии?`,
    articleId: 10,
    userId: 3,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Совсем немного... Неплохо, но дорого.`,
    articleId: 10,
    userId: 3,
  },
  {
    text: `Совсем немного... Неплохо, но дорого. Оплата наличными или перевод на карту? А где блок питания? Вы что?! В магазине дешевле.`,
    articleId: 10,
    userId: 4,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Вы что?! В магазине дешевле. Совсем немного...`,
    articleId: 10,
    userId: 3,
  },
  {
    text: `Неплохо, но дорого. А где блок питания? А сколько игр в комплекте?`,
    articleId: 10,
    userId: 4,
  },
];

module.exports.mockUsers = [
  {
    firstName: `Андрей`,
    lastName: `Чернов`,
    email: `foo@gmail.com`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: true,
  },
  {
    firstName: `Данил`,
    lastName: `Беллер`,
    email: `bar@mail.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: false,
  },
  {
    firstName: `Александр`,
    lastName: `Хаов`,
    email: `node@rumbler.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: false,
  },
  {
    firstName: `Александр`,
    lastName: `Чернов`,
    email: `js@outlook.com`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-4.png`,
    admin: false,
  },
  {
    firstName: `Артём`,
    lastName: `Гаврилов`,
    email: `browser@yandex.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: false,
  },
];

module.exports.mockArticleId = `1`;

module.exports.mockCommentId = `1`;

module.exports.mockValidComment = {
  text: `Как достигнуть успеха не вставая с кресла?`,
};

module.exports.mockInvalidComment = {
  title: `Как достигнуть успеха не вставая с кресла?`,
};
