"use strict";

module.exports.mockCategories = [
  `Программирование`,
  `Без рамки`,
  `Железо`,
  `За жизнь`,
  `Деревья`,
  `IT`,
  `Музыка`,
  `Кино`,
  `Разное`,
];

module.exports.mockArticles = [
  {
    title: `Рок — это протест`,
    announce: `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
    image: `forest@1x.jpg`,
    fullText: `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Ёлки — это не просто красивое дерево. Это прочная древесина. Программировать не настолько сложно, как об этом говорят. Достичь успеха помогут ежедневные повторения. Собрать камни бесконечности легко, если вы прирожденный герой. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Первая большая ёлка была установлена только в 1938 году. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Он написал больше 30 хитов. Простые ежедневные упражнения помогут достичь успеха. Из под его пера вышло 8 платиновых альбомов. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
    categories: [
      `Программирование`,
      `Без рамки`,
      `Кино`,
      `Деревья`,
      `Разное`,
      `За жизнь`,
      `IT`,
    ],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Как достигнуть успеха не вставая с кресла`,
    announce: `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    image: `sea@1x.jpg`,
    fullText: `Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Достичь успеха помогут ежедневные повторения. Из под его пера вышло 8 платиновых альбомов. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Простые ежедневные упражнения помогут достичь успеха. Золотое сечение — соотношение двух величин, гармоническая пропорция. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    categories: [`Деревья`, `Кино`, `Музыка`, `Без рамки`],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Как начать программировать`,
    announce: `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Как начать действовать? Для начала просто соберитесь. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
    image: `skyscraper@1x.jpg`,
    fullText: `Это один из лучших рок-музыкантов. Первая большая ёлка была установлена только в 1938 году. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Собрать камни бесконечности легко, если вы прирожденный герой. Программировать не настолько сложно, как об этом говорят. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    categories: [`Разное`, `Программирование`, `За жизнь`, `Музыка`],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Как достигнуть успеха не вставая с кресла`,
    announce: `Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    image: `forest@1x.jpg`,
    fullText: `Программировать не настолько сложно, как об этом говорят. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Первая большая ёлка была установлена только в 1938 году. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Простые ежедневные упражнения помогут достичь успеха. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Это один из лучших рок-музыкантов. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    categories: [`За жизнь`],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    title: `Как собрать камни бесконечности`,
    announce: `Из под его пера вышло 8 платиновых альбомов. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Он написал больше 30 хитов. Это один из лучших рок-музыкантов.`,
    image: `sea@1x.jpg`,
    fullText: `Достичь успеха помогут ежедневные повторения. Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Золотое сечение — соотношение двух величин, гармоническая пропорция. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Это один из лучших рок-музыкантов. Из под его пера вышло 8 платиновых альбомов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Первая большая ёлка была установлена только в 1938 году. Он написал больше 30 хитов. Простые ежедневные упражнения помогут достичь успеха. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    categories: [`Программирование`, `IT`],
    date: `2022-05-28T11:00:56.089Z`,
  },
];

module.exports.mockComments = [
  {
    text: `С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца. Вы что?! В магазине дешевле. Почему в таком ужасном состоянии? А сколько игр в комплекте?`,
    articleId: 1,
    userId: 4,
  },
  {
    text: `А где блок питания? Почему в таком ужасном состоянии? Оплата наличными или перевод на карту? С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 1,
    userId: 5,
  },
  {
    text: `Неплохо, но дорого. Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво? Совсем немного... А где блок питания?`,
    articleId: 1,
    userId: 2,
  },
  {
    text: `А сколько игр в комплекте? Неплохо, но дорого. Совсем немного... Вы что?! В магазине дешевле.`,
    articleId: 1,
    userId: 4,
  },
  {
    text: `Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. С чем связана продажа? Почему так дешёво? Оплата наличными или перевод на карту? Совсем немного...`,
    articleId: 1,
    userId: 3,
  },
  {
    text: `А сколько игр в комплекте? А где блок питания? Совсем немного...`,
    articleId: 2,
    userId: 3,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту? А где блок питания? Неплохо, но дорого.`,
    articleId: 2,
    userId: 5,
  },
  {
    text: `Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. Неплохо, но дорого.`,
    articleId: 2,
    userId: 5,
  },
  {
    text: `А сколько игр в комплекте? С чем связана продажа? Почему так дешёво? Почему в таком ужасном состоянии?`,
    articleId: 2,
    userId: 2,
  },
  {
    text: `Неплохо, но дорого. Оплата наличными или перевод на карту? С чем связана продажа? Почему так дешёво? А сколько игр в комплекте?`,
    articleId: 3,
    userId: 5,
  },
  {
    text: `Почему в таком ужасном состоянии? Вы что?! В магазине дешевле. А где блок питания? С чем связана продажа? Почему так дешёво? Неплохо, но дорого.`,
    articleId: 3,
    userId: 3,
  },
  {
    text: `А сколько игр в комплекте? А где блок питания? С чем связана продажа? Почему так дешёво? Почему в таком ужасном состоянии? Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 3,
    userId: 4,
  },
  {
    text: `Оплата наличными или перевод на карту? С чем связана продажа? Почему так дешёво? Вы что?! В магазине дешевле. А сколько игр в комплекте? Почему в таком ужасном состоянии?`,
    articleId: 3,
    userId: 5,
  },
  {
    text: `Вы что?! В магазине дешевле. Оплата наличными или перевод на карту? Совсем немного...`,
    articleId: 3,
    userId: 5,
  },
  {
    text: `Оплата наличными или перевод на карту? Почему в таком ужасном состоянии? С чем связана продажа? Почему так дешёво? А сколько игр в комплекте? Вы что?! В магазине дешевле.`,
    articleId: 4,
    userId: 5,
  },
  {
    text: `Почему в таком ужасном состоянии? С чем связана продажа? Почему так дешёво? Совсем немного...`,
    articleId: 4,
    userId: 5,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии? А где блок питания?`,
    articleId: 4,
    userId: 5,
  },
  {
    text: `А сколько игр в комплекте? Неплохо, но дорого. С чем связана продажа? Почему так дешёво? Совсем немного...`,
    articleId: 5,
    userId: 3,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии? Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво?`,
    articleId: 5,
    userId: 5,
  },
  {
    text: `Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. А где блок питания? А сколько игр в комплекте? Почему в таком ужасном состоянии?`,
    articleId: 5,
    userId: 5,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии? С чем связана продажа? Почему так дешёво?`,
    articleId: 5,
    userId: 5,
  },
  {
    text: `Вы что?! В магазине дешевле. Совсем немного... А где блок питания? Неплохо, но дорого.`,
    articleId: 6,
    userId: 3,
  },
  {
    text: `Совсем немного... А сколько игр в комплекте? С чем связана продажа? Почему так дешёво? А где блок питания?`,
    articleId: 6,
    userId: 4,
  },
  {
    text: `А сколько игр в комплекте? А где блок питания? Оплата наличными или перевод на карту?`,
    articleId: 6,
    userId: 1,
  },
  {
    text: `С чем связана продажа? Почему так дешёво? Неплохо, но дорого. Почему в таком ужасном состоянии? Совсем немного... Оплата наличными или перевод на карту?`,
    articleId: 6,
    userId: 3,
  },
  {
    text: `Совсем немного... А сколько игр в комплекте? Оплата наличными или перевод на карту?`,
    articleId: 6,
    userId: 5,
  },
  {
    text: `А сколько игр в комплекте? А где блок питания? Неплохо, но дорого. Оплата наличными или перевод на карту?`,
    articleId: 7,
    userId: 5,
  },
  {
    text: `Оплата наличными или перевод на карту? Почему в таком ужасном состоянии? Вы что?! В магазине дешевле.`,
    articleId: 7,
    userId: 4,
  },
  {
    text: `Почему в таком ужасном состоянии? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту? С чем связана продажа? Почему так дешёво?`,
    articleId: 7,
    userId: 4,
  },
  {
    text: `Совсем немного... А сколько игр в комплекте? Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво? Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 7,
    userId: 3,
  },
  {
    text: `Почему в таком ужасном состоянии? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 8,
    userId: 2,
  },
  {
    text: `Совсем немного... А где блок питания? Почему в таком ужасном состоянии? Вы что?! В магазине дешевле.`,
    articleId: 8,
    userId: 1,
  },
  {
    text: `Неплохо, но дорого. Оплата наличными или перевод на карту? Совсем немного...`,
    articleId: 8,
    userId: 5,
  },
  {
    text: `Оплата наличными или перевод на карту? А где блок питания? Продаю в связи с переездом. Отрываю от сердца. Вы что?! В магазине дешевле.`,
    articleId: 9,
    userId: 5,
  },
  {
    text: `Совсем немного... Неплохо, но дорого. Вы что?! В магазине дешевле. Оплата наличными или перевод на карту?`,
    articleId: 9,
    userId: 4,
  },
  {
    text: `Оплата наличными или перевод на карту? Продаю в связи с переездом. Отрываю от сердца. Совсем немного... С чем связана продажа? Почему так дешёво?`,
    articleId: 9,
    userId: 3,
  },
  {
    text: `Неплохо, но дорого. Вы что?! В магазине дешевле. А где блок питания?`,
    articleId: 9,
    userId: 1,
  },
  {
    text: `А где блок питания? Совсем немного... С чем связана продажа? Почему так дешёво? Неплохо, но дорого. Почему в таком ужасном состоянии?`,
    articleId: 10,
    userId: 2,
  },
  {
    text: `Совсем немного... Продаю в связи с переездом. Отрываю от сердца. А где блок питания? Вы что?! В магазине дешевле. А сколько игр в комплекте?`,
    articleId: 10,
    userId: 3,
  },
  {
    text: `Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту? А сколько игр в комплекте?`,
    articleId: 10,
    userId: 1,
  },
];

module.exports.mockUsers = [
  {
    firstName: `Андрей`,
    lastName: `Хаов`,
    email: `foo@gmail.com`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-3.png`,
    admin: true,
  },
  {
    firstName: `Александр`,
    lastName: `Хаов`,
    email: `bar@mail.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-3.png`,
    admin: false,
  },
  {
    firstName: `Владимир`,
    lastName: `Чернов`,
    email: `node@rumbler.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-3.png`,
    admin: false,
  },
  {
    firstName: `Артём`,
    lastName: `Чернов`,
    email: `js@outlook.com`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-4.png`,
    admin: false,
  },
  {
    firstName: `Владимир`,
    lastName: `Хаов`,
    email: `browser@yandex.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: false,
  },
];

module.exports.mockArticleId = `1`;

module.exports.mockValidArticle = {
  title: `Самый лучший музыкальный альбом этого года`,
  announce: `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
  image: `https://via.placeholder.com/150`,
  fullText: `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Простые ежедневные упражнения помогут достичь успеха. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Первая большая ёлка была установлена только в 1938 году. Достичь успеха помогут ежедневные повторения. Как начать действовать? Для начала просто соберитесь. Ёлки — это не просто красивое дерево. Это прочная древесина. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Собрать камни бесконечности легко, если вы прирожденный герой. Это один из лучших рок-музыкантов. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
  categories: [1, 2, 3, 4, 5],
  date: `2022-05-28T11:00:56.089Z`,
};

module.exports.mockInvalidArticle = {
  title: `Самый худший музыкальный альбом этого года`,
  announce: `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
  categories: [
    `Музыка`,
    `За жизнь`,
    `Железо`,
    `Кино`,
    `Разное`,
    `IT`,
    `Без рамки`,
    `Программирование`,
  ],
};
