"use strict";

module.exports.mockCategories = [
  { id: 1, name: `Деревья` },
  { id: 2, name: `За жизнь` },
  { id: 3, name: `Без рамки` },
  { id: 4, name: `Разное` },
  { id: 5, name: `IT` },
  { id: 6, name: `Музыка` },
  { id: 7, name: `Кино` },
  { id: 8, name: `Программирование` },
  { id: 9, name: `Железо` },
];

module.exports.mockArticles = [
  {
    id: 1,
    title: `Рок — это протест`,
    announce: `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
    image: `forest@1x.jpg`,
    fullText: `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Ёлки — это не просто красивое дерево. Это прочная древесина. Программировать не настолько сложно, как об этом говорят. Достичь успеха помогут ежедневные повторения. Собрать камни бесконечности легко, если вы прирожденный герой. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Первая большая ёлка была установлена только в 1938 году. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Он написал больше 30 хитов. Простые ежедневные упражнения помогут достичь успеха. Из под его пера вышло 8 платиновых альбомов. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
    categories: [8, 3, 7, 1, 4, 2, 5],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    id: 2,
    title: `Как достигнуть успеха не вставая с кресла`,
    announce: `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    image: `sea@1x.jpg`,
    fullText: `Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Достичь успеха помогут ежедневные повторения. Из под его пера вышло 8 платиновых альбомов. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Простые ежедневные упражнения помогут достичь успеха. Золотое сечение — соотношение двух величин, гармоническая пропорция. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    categories: [1, 7, 6, 3],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    id: 3,
    title: `Как начать программировать`,
    announce: `Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Как начать действовать? Для начала просто соберитесь. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
    image: `skyscraper@1x.jpg`,
    fullText: `Это один из лучших рок-музыкантов. Первая большая ёлка была установлена только в 1938 году. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Собрать камни бесконечности легко, если вы прирожденный герой. Программировать не настолько сложно, как об этом говорят. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    categories: [4, 8, 2, 6],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    id: 4,
    title: `Как достигнуть успеха не вставая с кресла`,
    announce: `Вы можете достичь всего. Стоит только немного постараться и запастись книгами.`,
    image: `forest@1x.jpg`,
    fullText: `Программировать не настолько сложно, как об этом говорят. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Первая большая ёлка была установлена только в 1938 году. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Простые ежедневные упражнения помогут достичь успеха. Освоить вёрстку несложно. Возьмите книгу новую книгу и закрепите все упражнения на практике. Это один из лучших рок-музыкантов. Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле? Золотое сечение — соотношение двух величин, гармоническая пропорция.`,
    categories: [2],
    date: `2022-05-28T11:00:56.089Z`,
  },
  {
    id: 5,
    title: `Как собрать камни бесконечности`,
    announce: `Из под его пера вышло 8 платиновых альбомов. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Он написал больше 30 хитов. Это один из лучших рок-музыкантов.`,
    image: `sea@1x.jpg`,
    fullText: `Достичь успеха помогут ежедневные повторения. Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Золотое сечение — соотношение двух величин, гармоническая пропорция. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать. Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Это один из лучших рок-музыкантов. Из под его пера вышло 8 платиновых альбомов. Помните, небольшое количество ежедневных упражнений лучше, чем один раз, но много. Первая большая ёлка была установлена только в 1938 году. Он написал больше 30 хитов. Простые ежедневные упражнения помогут достичь успеха. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры. Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    categories: [8, 5],
    date: `2022-05-28T11:00:56.089Z`,
  },
];

module.exports.mockArticleId = `1`;

module.exports.mockValidArticle = {
  title: `Самый лучший музыкальный альбом этого года`,
  announce: `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
  image: `https://via.placeholder.com/150`,
  fullText: `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем. Программировать не настолько сложно, как об этом говорят. Этот смартфон — настоящая находка. Большой и яркий экран, мощнейший процессор — всё это в небольшом гаджете. Простые ежедневные упражнения помогут достичь успеха. Вы можете достичь всего. Стоит только немного постараться и запастись книгами. Первая большая ёлка была установлена только в 1938 году. Достичь успеха помогут ежедневные повторения. Как начать действовать? Для начала просто соберитесь. Ёлки — это не просто красивое дерево. Это прочная древесина. Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами. Собрать камни бесконечности легко, если вы прирожденный герой. Это один из лучших рок-музыкантов. Альбом стал настоящим открытием года. Мощные гитарные рифы и скоростные соло-партии не дадут заскучать.`,
  categories: [1, 2, 3, 4, 5],
  date: `2022-05-28T11:00:56.089Z`,
};

module.exports.mockInvalidArticle = {
  title: `Самый худший музыкальный альбом этого года`,
  announce: `Рок-музыка всегда ассоциировалась с протестами. Так ли это на самом деле?`,
  categories: [6, 2, 9, 7, 4, 5, 3, 8],
};

module.exports.mockComments = [
  {
    id: 1,
    text: `А где блок питания? Неплохо, но дорого. А сколько игр в комплекте? Совсем немного... Вы что?! В магазине дешевле.`,
    articleId: 1,
    userId: 3,
  },
  {
    id: 2,
    text: `Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту? Вы что?! В магазине дешевле. С чем связана продажа? Почему так дешёво?`,
    articleId: 1,
    userId: 2,
  },
  {
    id: 3,
    text: `Совсем немного... А где блок питания? С чем связана продажа? Почему так дешёво? А сколько игр в комплекте?`,
    articleId: 1,
    userId: 3,
  },
  {
    id: 4,
    text: `А сколько игр в комплекте? Неплохо, но дорого. Оплата наличными или перевод на карту? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 2,
    userId: 3,
  },
  {
    id: 5,
    text: `Продаю в связи с переездом. Отрываю от сердца. А сколько игр в комплекте? Совсем немного... Неплохо, но дорого.`,
    articleId: 2,
    userId: 3,
  },
  {
    id: 6,
    text: `А где блок питания? Оплата наличными или перевод на карту? Неплохо, но дорого.`,
    articleId: 2,
    userId: 4,
  },
  {
    id: 7,
    text: `Совсем немного... А сколько игр в комплекте? Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца.`,
    articleId: 3,
    userId: 4,
  },
  {
    id: 8,
    text: `С чем связана продажа? Почему так дешёво? Оплата наличными или перевод на карту? Почему в таком ужасном состоянии? Вы что?! В магазине дешевле. А сколько игр в комплекте?`,
    articleId: 3,
    userId: 3,
  },
  {
    id: 9,
    text: `А где блок питания? С чем связана продажа? Почему так дешёво? Неплохо, но дорого. Продаю в связи с переездом. Отрываю от сердца. Совсем немного...`,
    articleId: 3,
    userId: 2,
  },
  {
    id: 10,
    text: `Продаю в связи с переездом. Отрываю от сердца. Неплохо, но дорого. Вы что?! В магазине дешевле. А сколько игр в комплекте? Почему в таком ужасном состоянии?`,
    articleId: 3,
    userId: 2,
  },
  {
    id: 11,
    text: `А где блок питания? Почему в таком ужасном состоянии? Оплата наличными или перевод на карту?`,
    articleId: 4,
    userId: 2,
  },
  {
    id: 12,
    text: `Неплохо, но дорого. А где блок питания? Продаю в связи с переездом. Отрываю от сердца. Почему в таком ужасном состоянии?`,
    articleId: 4,
    userId: 1,
  },
  {
    id: 13,
    text: `Вы что?! В магазине дешевле. Продаю в связи с переездом. Отрываю от сердца. Оплата наличными или перевод на карту? А сколько игр в комплекте?`,
    articleId: 4,
    userId: 4,
  },
  {
    id: 14,
    text: `С чем связана продажа? Почему так дешёво? Почему в таком ужасном состоянии? Неплохо, но дорого.`,
    articleId: 5,
    userId: 5,
  },
  {
    id: 15,
    text: `Вы что?! В магазине дешевле. А где блок питания? Почему в таком ужасном состоянии? Продаю в связи с переездом. Отрываю от сердца. С чем связана продажа? Почему так дешёво?`,
    articleId: 5,
    userId: 5,
  },
  {
    id: 16,
    text: `А где блок питания? А сколько игр в комплекте? Неплохо, но дорого. Почему в таком ужасном состоянии? Вы что?! В магазине дешевле.`,
    articleId: 5,
    userId: 1,
  },
];

module.exports.mockUsers = [
  {
    id: 1,
    firstName: `Андрей`,
    lastName: `Чернов`,
    email: `foo@gmail.com`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: true,
  },
  {
    id: 2,
    firstName: `Данил`,
    lastName: `Беллер`,
    email: `bar@mail.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: false,
  },
  {
    id: 3,
    firstName: `Александр`,
    lastName: `Хаов`,
    email: `node@rumbler.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: false,
  },
  {
    id: 4,
    firstName: `Александр`,
    lastName: `Чернов`,
    email: `js@outlook.com`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-4.png`,
    admin: false,
  },
  {
    id: 5,
    firstName: `Артём`,
    lastName: `Гаврилов`,
    email: `browser@yandex.ru`,
    passwordHash: `$2a$10$47Jc9oY.7eu.NnjaJ5wBbu.TvUbYkQSEpZcvB0v.sDDobGTR1/P6m`,
    avatar: `avatar-5.png`,
    admin: false,
  },
];

module.exports.mockAdminAuthData = {
  email: `foo@gmail.com`,
  password: `1234567890`,
};

module.exports.mockAuthData = {
  email: `bar@mail.ru`,
  password: `1234567890`,
};
